#31페이지 프로그램 02-01
'''
print('Python')
print('파이썬')
'''
import sys

#32페이지 Thinking 1번 p43
'''
print('안녕 Python')
'''

#32페이지 Thinking 2번 p43
'''
print("ABC", "A'sC")
print('ABC', 'A"BC')
print("""ABC""")
'''

#32페이지 잠깐코딩 1번 p47
'''
print('안녕'+'Python')
print('안녕','파이썬')
'''

#32페이지 잠깐코딩 2번 p47
'''
print('안녕 ' + '파이썬')
print('안녕'+' '+'파이썬')
'''

#32페이지 잠깐코딩 3번 p47
'''
print('10' + '20') # 문자 + 문자
print('10' + 20) # 문자열 + 숫자는 자료형이 다르므로 에러
'''

#32페이지 잠깐코딩 4번 p47
'''
print('파이썬 ' * 10)
'''

# 33페이지 TIP
'''
print(sys.maxsize)
print(-sys.maxsize-1)
'''

#33페이지 프로그램 02-02
'''
print(1)
print(1, 0, -1, 100, 1234567890)
print(1.2, -1.2, 0.123456789)
'''

#34페이지 Thinkig 3번
'''
print(1234567890)
print(-1234567890)
'''

#34페이지 Thinkig 4번
'''
print(0.1234567890123456789) #소수점 17자리까지 표현되고 18자리에서 반올림
'''

#35페이지 프로그램 02-03
'''
print(6 + 4)
print(6 - 4)
print(6 * 4)
print(6 / 4)
'''

#35페이지 Thinking 5번
'''
print(6 // 4)
print(6 % 4)
'''

#35페이지 Thinking 6번
'''
print(0 / 1)
print(0 / 0) #에러 0으로는 못 나눔
print(1 / 0)#에러 0으로는 못 나눔
'''

#35페이지 Thinking 7번
'''
print(123456789012345678901 + 1)
'''

#35페이지 잠깐코딩 5번
'''
print(1+ 2 + 3 + 4 + 5)
'''

#35페이지 잠깐코딩 6번
'''
print((5 + 10 + 15) / 3)
'''

#35페이지 잠깐코딩 7번
'''
print('6 + 4 =', 6+4)
'''

















